/*
Додайте у 2 завдання завантаження товарів по частинам. Для цього треба 
робити запит на адресу "https://67e3b7b52ae442db76d13e6a.mockapi.io/api/products?_page=1&_limit=10",
де замість 1 ви передаєте номер сторінки і замість 10 - кількість об'єктів на сторінці.
Код має працювати так: 
1. При завантажені сторінки завантажуються перші 10 товарів.
2. Після успішного завантаження під списком товарів зв'являється кнопка з текстом "Load more".
3. При натискані на цю кнопку робиться запит за тією ж адресою, але значення _page має бути на 1 більше.
Нові товари додаются в список після тих, що вже є.
*/