/*
Перед вами масив зі списком книг. Виведіть кожну книгу у консоль у форматі строки: Автор: . Назва: . Ціна: .
Для перетворення об'єкта на строку напишіть функцію.
Якщо якогось поля немає - виведіть в консоль замість книги помилку - якого поля не вистачає.

const books = [{
        "author": "Скотт Беккер",
        "name": "Темрява, що приходить першою",
        "price": 70
    }, {
        "author": "Скотт Беккер",
        "name": "Воїн-пророк"
    }, {
        "name": "Тисячократна думка",
        "price": 70
    }, {
        "author": "Скотт Беккер",
        "name": "Нечестивий Консульт",
        "price": 70
    }, {
        "author": "Дар'я Донцова",
        "name": "Детектив на дієті",
        "price": 40
    },
    {
        "author": "Дар'я Донцова",
        "name": "Дід Снігур і Морозонька"
    }
];
*/